"""Завдання 1.1
a = int(input("Введіть кількість монет: "))
if a >= 100:
    print("Ви можете купити меч")
elif a >= 50:
    print("Ви можете купити щит")
else:
    print("Ви можете купити зілля")"""

"""Завдання 1.2
a = int(input("Введіть ваш рівень: "))
if a > 10:
    print("Ви готові до великої битви!")
elif a > 5:
    print("Ви на шляху до майстра")
else:
    print("Тренуйтесь більше!")"""

"""Завдання 1.3
a = int(input("Введіть HP: "))
if a > 50:
    print("Перемога")
elif 30 <= a <= 50:
    print("Перемога, але ви отримали рани")
else:
    print("Поразка")"""

"""Завдання 2.1
coins = [ 1, 10, 25, 55, 50, 100]
total = 0
for coin in coins:
    total += coin
print("Загальна кількість монет:", total)"""

"""Завдання 2.2
inventory = ["меч", "щит", "зілля", "амулет", "монети"]
count = 0
for item in inventory:
    print(item)
    count += 1
print("Кількість предметів:", count)"""

"""Завдання 2.3
inventory = {
    "меч": "озброєння",
    "щит": "озброєння",
    "зілля": "ліки",
    "амулет": "аксесуар",
    "монети": "валюта"
}
for i, category in inventory.items():
    if category == "озброєння":
        print("озброєння", i)"""

"""Завдання 2.4"""
scores = [55, 40, 75, 30, 65, 80, 45, 100]
count = 0
for score in scores:
    if score > 50:
        count += 1
print("Кількість результатів більше 50:", count)
